#### 주어진 데이터(basic2.csv)에서 새로운 컬럼(1일 이전 시차 컬럼)을 만들고, Events가 1이면서 Sales가 1000000이하인 조건에 맞는 새로운 컬럼 합을 구하시오
데이터셋 : basic2.csv

In [1]:
import os
from os.path import join

import pandas as pd

In [2]:
file_NM = join('data', 'basic2.csv')
df = pd.read_csv(file_NM)
df.head(3)

         Date     Sales      PV      UV  Events
0  2022-01-01  22711525  397349  4421.0       1
1  2022-01-02     36779    3969  2289.0       0
2  2022-01-03  13943875  373890     NaN       1

In [3]:
df['before_PV'] = df['PV'].shift(1)
df

           Date     Sales      PV      UV  Events  before_PV
0    2022-01-01  22711525  397349  4421.0       1        NaN
1    2022-01-02     36779    3969  2289.0       0   397349.0
2    2022-01-03  13943875  373890     NaN       1     3969.0
3    2022-01-04   8088593  142054  2157.0       0   373890.0
4    2022-01-05   2395374  190684     NaN       0   142054.0
..          ...       ...     ...     ...     ...        ...
725  2023-12-27  33846609  415067  7360.0       1    51258.0
726  2023-12-28   3659566  208601  2262.0       1   415067.0
727  2023-12-29   1164008   14309   193.0       0   208601.0
728  2023-12-30   3977696   60935     NaN       0    14309.0
729  2023-12-31   3719764   60963  1507.0       0    60935.0

[730 rows x 6 columns]

In [4]:
df['before_PV'] = df['before_PV'].fillna(method='bfill')
df

           Date     Sales      PV      UV  Events  before_PV
0    2022-01-01  22711525  397349  4421.0       1   397349.0
1    2022-01-02     36779    3969  2289.0       0   397349.0
2    2022-01-03  13943875  373890     NaN       1     3969.0
3    2022-01-04   8088593  142054  2157.0       0   373890.0
4    2022-01-05   2395374  190684     NaN       0   142054.0
..          ...       ...     ...     ...     ...        ...
725  2023-12-27  33846609  415067  7360.0       1    51258.0
726  2023-12-28   3659566  208601  2262.0       1   415067.0
727  2023-12-29   1164008   14309   193.0       0   208601.0
728  2023-12-30   3977696   60935     NaN       0    14309.0
729  2023-12-31   3719764   60963  1507.0       0    60935.0

[730 rows x 6 columns]

In [6]:
result = df[(df['Events'] == 1) & (df['Sales']<=1000000)]
result

           Date   Sales      PV      UV  Events  before_PV
177  2022-06-27  267792  292946  5631.0       1   180613.0
228  2022-08-17  288823   20069  5928.0       1    14671.0
241  2022-08-30  281531  268719  7835.0       1   223929.0
303  2022-10-31  314119  255878     NaN       1    11459.0
357  2022-12-24  928788  224920  3004.0       1   323409.0
425  2023-03-02  619266    8881  6600.0       1   207915.0
439  2023-03-16  205989  215055  2245.0       1     1134.0
478  2023-04-24  474873   47738     NaN       1    48198.0
505  2023-05-21  511032  100113  5490.0       1   128965.0
507  2023-05-23  948566   59527  8640.0       1   161647.0
601  2023-08-25  715507   17079  6465.0       1   316069.0
675  2023-11-07  641243  102611  6490.0       1   276867.0

In [7]:
result['before_PV'].sum()

1894876.0